app/controllers/contas_controller.rb

  def index
    @contas = Conta.all
---
SELECT * FROM "contas"

  def show
    @conta = Conta.find(params[:id])
---
SELECT * FROM "contas" WHERE ("contas"."id" = 1)

  def create
    @conta = Conta.new(params[:conta])

    respond_to do |format|
      if @conta.save
---
INSERT INTO "contas" ("created_at", "nome", "updated_at", "descricao") VALUES('2010-07-04 13:55:32', 'VISA', '2010-07-04 13:55:32', 'Cartão de crédito VISA do banco Real.')