app/controllers/movimentos_controller.rb

  def create
    @movimento = Movimento.new(params[:movimento])

    respond_to do |format|
      if @movimento.save
---
INSERT INTO "movimentos" ("conta_id", "created_at", "updated_at", "valor", "tipo_id", "dia", "descricao") VALUES(1, '2010-07-04 14:27:40', '2010-07-04 14:27:40', 612.53, 1, '2010-07-04', 'Saldo inicial.')

  def index
    @movimentos = Movimento.all
---
SELECT * FROM "movimentos" WHERE ("movimentos".conta_id = 1)

  def edit
    @movimento = Movimento.find(params[:id])
---
SELECT * FROM "movimentos" WHERE ("movimentos"."id" = 1)

  def update
    @movimento = Movimento.find(params[:id])

    respond_to do |format|
      if @movimento.update_attributes(params[:movimento])
---
SELECT * FROM "movimentos" WHERE ("movimentos"."id" = 1)
UPDATE "movimentos" SET "updated_at" = '2010-07-04 15:00:23', "tipo_id" = 6 WHERE "id" = 1

  def show
    @movimento = Movimento.find(params[:id])
---
SELECT * FROM "movimentos" WHERE ("movimentos"."id" = 1)