app/controllers/pagamentos_controller.rb

  def index
    @pagamentos = Pagamento.all
---
SELECT * FROM "pagamentos"

  def show
    @pagamento = Pagamento.find(params[:id])
---
SELECT * FROM "pagamentos" WHERE ("pagamentos"."id" = 1)

  def edit
    @pagamento = Pagamento.find(params[:id])
---
SELECT * FROM "pagamentos" WHERE ("pagamentos"."id" = 4)

  def create
    @pagamento = Pagamento.new(params[:pagamento])

    respond_to do |format|
      if @pagamento.save
---
INSERT INTO "pagamentos" ("created_at", "nome", "updated_at", "valor", "confirmado", "vencimento", "descricao") VALUES('2010-07-04 16:43:41', 'CARTAO PORTO SEGURO', '2010-07-04 16:43:41', 1063.61, 't', '2010-07-03', '')

  def update
    @pagamento = Pagamento.find(params[:id])

    respond_to do |format|
      if @pagamento.update_attributes(params[:pagamento])
---
SELECT * FROM "pagamentos" WHERE ("pagamentos"."id" = 4)
UPDATE "pagamentos" SET "updated_at" = '2010-07-04 18:38:06', "valor" = 93.36, "descricao" = 'Apenas no mês de julho o pagamento ficou para o dia 19. Os demais deverão ser feitos via débito automático. Apenas verificar se foi confirmado.', "vencimento" = '2010-07-19' WHERE "id" = 10