app/controllers/tipos_controller.rb

  def index
    @tipos = Tipo.all(:order => "nome", :conditions => { :user_id => current_user.id })
---
SELECT * FROM "tipos"

  def show
    @tipo = Tipo.find(params[:id])
---
SELECT * FROM "tipos" WHERE ("tipos"."id" = 1)

  def edit
    @tipo = Tipo.find(params[:id])
---
SELECT * FROM "tipos" WHERE ("tipos"."id" = 1)

  def create
    @tipo = Tipo.new(params[:tipo])
    @tipo.user = current_user

    respond_to do |format|
      if @tipo.save
---
INSERT INTO "tipos" ("created_at", "nome", "updated_at", "valor", "descricao") VALUES('2010-07-04 15:27:49', 'CREDITO CC', '2010-07-04 15:27:49', 'C', 'Crédito em conta corrente.')

  def update
    @tipo = Tipo.find(params[:id])

    respond_to do |format|
      if @tipo.update_attributes(params[:tipo])
---
SELECT * FROM "tipos" WHERE ("tipos"."id" = 1)
UPDATE "tipos" SET "updated_at" = '2010-07-04 15:26:52', "valor" = 'D' WHERE "id" = 1